Documents/АктКлиенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктКлиенту</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчётыСКлиентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАкта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кампания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лиды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депозиты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДепозитов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктКлиенту/Ext/ManagerModule.bsl
Функция СформироватьПечатнуюФорму(АктСсылка) Экспорт
	
	Макет = Документы.АктКлиенту.ПолучитьМакет("МакетАкта");
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", АктСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктКлиенту.Номер КАК Номер,
	|	АктКлиенту.Дата КАК Дата,
	|	АктКлиенту.Клиент КАК Клиент,
	|	АктКлиенту.ДатаНачала КАК ДатаНачала,
	|	АктКлиенту.ДатаОкончания КАК ДатаОкончания,
	|	АктКлиенту.Валюта КАК Валюта
	|ИЗ
	|	Документ.АктКлиенту КАК АктКлиенту
	|ГДЕ
	|	АктКлиенту.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	АктКлиентуНачисления.Кампания КАК Кампания,
	|	АктКлиентуНачисления.Лиды КАК Лиды,
	|	АктКлиентуНачисления.Депозиты КАК Депозиты,
	|	АктКлиентуНачисления.СуммаДепозитов КАК СуммаДепозитов,
	|	АктКлиентуНачисления.Сумма КАК Сумма
	|ИЗ
	|	Документ.АктКлиенту.Начисления КАК АктКлиентуНачисления
	|ГДЕ
	|	АктКлиентуНачисления.Ссылка = &Ссылка";
	Результаты = Запрос.ВыполнитьПакет();
	
	Шапка = Результаты[0].Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.НомерАкта = Шапка.Номер;
	Область.Параметры.ДатаАкта = Формат(Шапка.Дата, "ДЛФ=D");
	Область.Параметры.Клиент = Шапка.Клиент;
	Область.Параметры.ДатаНачала = Формат(Шапка.ДатаНачала, "ДЛФ=D");
	Область.Параметры.ДатаОкончания = Формат(Шапка.ДатаОкончания, "ДЛФ=D");
	Область.Параметры.Валюта = Шапка.Валюта;
	ТабДок.Вывести(Область);
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
	СуммаИтого = 0;
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область);
		СуммаИтого = СуммаИтого + Выборка.Сумма;
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Итого");
	Область.Параметры.СуммаИтого = СуммаИтого;
	ТабДок.Вывести(Область);
	
	Возврат ТабДок;
	
КонецФункции
